Личный_помощник/src/Catalogs/ВидыУслуг/ВидыУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыУслуг</name>
  <predefined>
    <items>
      <name>Водоотведение</name>
      <description>Водоотведение</description>
    </items>
    <items>
      <name>Газ</name>
      <description>Газ</description>
    </items>
    <items>
      <name>ГорячаяВода</name>
      <description>Горячая вода</description>
    </items>
    <items>
      <name>Домофон</name>
      <description>Домофон</description>
    </items>
    <items>
      <name>Интернет</name>
      <description>Интернет</description>
    </items>
    <items>
      <name>КапитальныйРемонт</name>
      <description>Капитальный ремонт</description>
    </items>
    <items>
      <name>Отопление</name>
      <description>Отопление</description>
    </items>
    <items>
      <name>СодержаниеЖилья</name>
      <description>Содержание жилья</description>
    </items>
    <items>
      <name>ХолоднаяВода</name>
      <description>Холодная вода</description>
    </items>
    <items>
      <name>Электроэнергия</name>
      <description>Электроэнергия</description>
    </items>
  </predefined>
  <attributes>
    <name>ПоСчетчику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСумма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольнаяСумма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Личный_помощник/src/Catalogs/ВидыУслуг/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьДаннымиИзМакета()Экспорт
	
	Макет = Справочники.ВидыУслуг.ПолучитьМакет("ЗаполнениеПредопределенныхЭлементов");
	КолонкиМакета = СтруктураСоответствияКолонокМакетаРеквизитам();
	НомерСтроки = 2;
	Пока Истина Цикл
		
		ИмяПредопределенногоЭлемента = Макет.Область("R" + НомерСтроки + "C1").Текст;
		Если Не ЗначениеЗаполнено(ИмяПредопределенногоЭлемента) Тогда
			Прервать;	
		КонецЕсли;
		
		ЭлементСправочника = Справочники.ВидыУслуг[ИмяПредопределенногоЭлемента];
		ОбъектСправочника = ЭлементСправочника.ПолучитьОбъект();
		
		Для Каждого КолонкаМакета Из КолонкиМакета Цикл
			ОбъектСправочника[КолонкаМакета.Ключ] = Макет.Область("R" + НомерСтроки + КолонкаМакета.Значение).Текст;	
		КонецЦикла;
		
		КодЕдиницыИзмерения = Макет.Область("R" + НомерСтроки + "C6").Текст;
		Если ЗначениеЗаполнено(КодЕдиницыИзмерения) Тогда
			ЕдиницИзмеренияСсылка = Справочники.ЕдиницыИзмерения.НайтиПоКоду(КодЕдиницыИзмерения, Истина);
			Если ЗначениеЗаполнено(ЕдиницИзмеренияСсылка) Тогда
				ОбъектСправочника.ЕдиницаИзмерения = ЕдиницИзмеренияСсылка;	
			КонецЕсли;			
		КонецЕсли;		 
		
		ОбъектСправочника.Записать();
		
		НомерСтроки = НомерСтроки + 1;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеМетоды

Функция СтруктураСоответствияКолонокМакетаРеквизитам()
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "C2");
	Результат.Вставить("ПоСчетчику", "C3");
	Результат.Вставить("ФиксированнаяСумма", "C4");
	Результат.Вставить("ПроизвольнаяСумма", "C5");;
	Возврат Результат;
	
КонецФункции


#КонецОбласти
